import logging

from .language import Language

logger = logging.getLogger(__name__)


class Katakana(Language):
    _charset = [
        'あ', 'い', 'う', 'え', 'お',
        'か', 'き', 'く', 'け', 'こ',
        'が', 'ぎ', 'ぐ', 'げ', 'ご',
        'さ', 'し', 'す', 'せ', 'そ',
        'ざ', 'じ', 'ず', 'ぜ', 'ぞ',
        'た', 'ち', 'つ', 'て', 'と',
        'だ', 'ぢ', 'づ', 'で', 'ど',
        'な', 'に', 'ぬ', 'ね', 'の',
        'は', 'ひ', 'ふ', 'へ', 'ほ',
        'ば', 'び', 'ぶ', 'べ', 'ぼ',
        'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',
        'ま', 'み', 'む', 'め', 'も',
        'や', 'ゆ', 'よ',
        'ら', 'り', 'る', 'れ', 'ろ',
        'わ', 'を', 'ん',
        'きゃ', 'きゅ', 'きょ',
        'ぎゃ', 'ぎゅ', 'ぎょ',
        'しゃ', 'しゅ', 'しょ',
        'じゃ', 'じゅ', 'じょ',
        'ちゃ', 'ちゅ', 'ちょ',
        'ぢゃ', 'ぢゅ', 'ぢょ',
        'にゃ', 'にゅ', 'にょ',
        'ひゃ', 'ひゅ', 'ひょ',
        'びゃ', 'びゅ', 'びょ',
        'ぴゃ', 'ぴゅ', 'ぴょ',
        'みゃ', 'みゅ', 'みょ',
        'りゃ', 'りゅ', 'りょ',
        'R'
    ]

    _as_valid = {
        '\n': 'R', ' ': 'R'
    }

    _suffix_lookup = {
        'あ': 'a', 'い': 'i', 'う': 'u', 'え': 'e', 'お': 'o',
        'か': 'a', 'き': 'i', 'く': 'u', 'け': 'e', 'こ': 'o',
        'が': 'a', 'ぎ': 'i', 'ぐ': 'u', 'げ': 'e', 'ご': 'o',
        'さ': 'a', 'し': 'i', 'す': 'u', 'せ': 'e', 'そ': 'o',
        'ざ': 'a', 'じ': 'i', 'ず': 'u', 'ぜ': 'e', 'ぞ': 'o',
        'た': 'a', 'ち': 'i', 'つ': 'u', 'て': 'e', 'と': 'o',
        'だ': 'a', 'ぢ': 'i', 'づ': 'u', 'で': 'e', 'ど': 'o',
        'な': 'a', 'に': 'i', 'ぬ': 'u', 'ね': 'e', 'の': 'o',
        'は': 'a', 'ひ': 'i', 'ふ': 'u', 'へ': 'e', 'ほ': 'o',
        'ば': 'a', 'び': 'i', 'ぶ': 'u', 'べ': 'e', 'ぼ': 'o',
        'ぱ': 'a', 'ぴ': 'i', 'ぷ': 'u', 'ぺ': 'e', 'ぽ': 'o',
        'ま': 'a', 'み': 'i', 'む': 'u', 'め': 'e', 'も': 'o',
        'や': 'a', 'ゆ': 'u', 'よ': 'o',
        'ら': 'a', 'り': 'i', 'る': 'u', 'れ': 'e', 'ろ': 'o',
        'わ': 'a', 'を': 'o', 'ん': '-',
        'きゃ': 'a', 'きゅ': 'u', 'きょ': 'o',
        'ぎゃ': 'a', 'ぎゅ': 'u', 'ぎょ': 'o',
        'しゃ': 'a', 'しゅ': 'u', 'しょ': 'o',
        'じゃ': 'a', 'じゅ': 'u', 'じょ': 'o',
        'ちゃ': 'a', 'ちゅ': 'u', 'ちょ': 'o',
        'ぢゃ': 'a', 'ぢゅ': 'u', 'ぢょ': 'o',
        'にゃ': 'a', 'にゅ': 'u', 'にょ': 'o',
        'ひゃ': 'a', 'ひゅ': 'u', 'ひょ': 'o',
        'びゃ': 'a', 'びゅ': 'u', 'びょ': 'o',
        'ぴゃ': 'a', 'ぴゅ': 'u', 'ぴょ': 'o',
        'みゃ': 'a', 'みゅ': 'u', 'みょ': 'o',
        'りゃ': 'a', 'りゅ': 'u', 'りょ': 'o',
        '-': '-', 'R': '-'
    }
